
#Перевод напряжения в давление (Перенесено в 4,0 с 4,2 от ошибки)
def p_uinp(x):
    if x >= 4.26: #1000
        return 1000
    if x < 4.26 and x >= 4.25: #1000 - 100
        return ((1000 - 100)*(x - 4.25)/(4.26 - 4.25)) + 100
    if x < 4.25 and x >= 4.24: #100 - 70
        return ((100 - 70)*(x - 4.24)/(4.25 - 4.24)) + 70
    if x < 4.24 and x >= 4.21: #70 - 40
        return ((70 - 40)*(x - 4.21)/(4.24 - 4.21)) + 40
    if x < 4.21 and x >= 4.1: #40 - 20
        return ((40 - 20)*(x - 4.1)/(4.21 - 4.1)) + 20
    if x < 4.1 and x >= 3.83: #20 - 10
        return ((20 - 10)*(x - 3.83)/(4.1 - 3.83)) + 10
    if x < 3.83 and x >= 3.66: #10 - 7
        return ((10 - 7)*(x - 3.66)/(3.83 - 3.66)) + 7
    if x < 3.66 and x >= 3.36: #7 - 4
        return ((7 - 4)*(x - 3.36)/(3.66 - 3.36)) + 4
    if x < 3.36 and x >= 2.9221: #4 - 2
        return ((4 - 2)*(x - 2.9221)/(3.36 - 2.9221)) + 2
    if x < 2.9221 and x >= 2.4325: #2 - 1
        return ((2 - 1)*(x - 2.4325)/(2.9221 - 2.4325)) + 1
    if x < 2.4325 and x >= 2.1693: #1 - 0.7
        return ((1 - 0.7)*(x - 2.1693)/(2.4325 - 2.1693)) + 0.7
    if x < 2.1693 and x >= 1.774: #0.7 - 0.4
        return ((0.7 - 0.4)*(x - 1.774)/(2.1693 - 1.774)) + 0.4
    if x < 1.774 and x >= 1.3509: #0.4 - 0.2
        return ((0.4 - 0.2)*(x - 1.3509)/(1.774 - 1.3509)) + 0.2
    if x < 1.3509 and x >= 1.0211: #0.2 - 0.1
        return ((0.2 - 0.1)*(x - 1.0211)/(1.3509 - 1.0211)) + 0.1
    if x < 1.0211 and x >= 0.8888: #0.1 - 0.07
        return ((0.1 - 0.07)*(x - 0.8888)/(1.0211 - 0.8888)) + 0.07
    if x < 0.8888 and x >= 0.726: #0.07 - 0.04
        return ((0.07 - 0.04)*(x - 0.726)/(0.8888 - 0.726)) + 0.04
    if x < 0.726 and x >= 0.5904: #0.04 - 0.02
        return ((0.04 - 0.02)*(x - 0.5904)/(0.726 - 0.5904)) + 0.02
    if x < 0.5904 and x >= 0.5079: #0.02 - 0.01
        return ((0.02 - 0.01)*(x - 0.5079)/(0.5904 - 0.5079)) + 0.01
    if x < 0.5079 and x >= 0.4797: #0.01 - 0.007
        return ((0.01 - 0.007)*(x - 0.4797)/(0.5079 - 0.4797)) + 0.007
    if x < 0.4797 and x >= 0.4494: #0.007 - 0.004
        return ((0.007 - 0.004)*(x - 0.4494)/(0.4797 - 0.4494)) + 0.004
    if x < 0.4494 and x >= 0.4281: #0.004 - 0.002
        return ((0.004 - 0.002)*(x - 0.4281)/(0.4494 - 0.4281)) + 0.002
    if x < 0.4281 and x >= 0.4169: #0.002 - 0.001
        return ((0.002 - 0.001)*(x - 0.4169)/(0.4281 - 0.4169)) + 0.001
    if x < 0.4169 and x >= 0.4054: #0.001 - 0.0001
        return ((0.001 - 0.0001)*(x - 0.4054)/(0.4169 - 0.4054)) + 0.0001
    else:
        return 0

#Перевод температуры генераора RF small
def t_uint(x):
    if x >= 6.2: 
        return 20
    if x < 6.2 and x >= 5: #20 - 25
        return ((20 - 25)*(x - 6.2)/(6.2 - 5)) + 20
    if x < 5 and x >= 4: #25 - 30
        return ((25 - 30)*(x - 5)/(5 - 4)) + 25
    if x < 4 and x >= 2.7: #30 - 40
        return ((30 - 40)*(x - 4)/(4 - 2.7)) + 30
    if x < 2.7 and x >= 1.8: #40 - 50
        return ((40 - 50)*(x - 2.7)/(2.7 - 1.8)) + 40
    if x < 1.8 and x >= 1.2: #50 - 60
        return ((50 - 60)*(x - 1.8)/(1.8 - 1.2)) + 50
    if x < 1.2 and x >= 1: #60 - 65
        return ((60 - 65)*(x - 1.2)/(1.2 - 1)) + 60
    if x < 1 and x >= 0.9: #65 - 70
        return ((65 - 70)*(x - 1)/(1 - 0.9)) + 65
    else:
        return 20

#Определение степени 
def dec(x):
    x = round(x, 3)
    if x >= 1000:
        return 3
    if x < 1000 and x >= 100:
        return 2
    if x < 100 and x >= 10:
        return 1
    if x < 10 and x >= 1:
        return 0
    if x < 1 and x >= 0.1:
        return -1
    if x < 0.1 and x >= 0.01:
        return -2
    if x < 0.01 and x >= 0.001:
        return -3
    if x < 0.001:
        return -4

#Расчет значения множителя 1
def Factor1(w):
    f = round((-0.0001022*(w**2)) + (0.03627*w) + (3.35), 4)
    return f


#Расчет значения множителя 2
def Factor2(w):
    f = round((0.0000000043*(w**2)) + (-0.000001288*w) + (-0.0001063), 7)
    return f

#Вт и давление в В (0 .. 5 В)
def u_start(w, p):
    u = round((Factor2(w) * p ) + Factor1(w), 3)
    if u > 4.95 : u = 4.95
    if u < 2.1 : u = 2.1
    return u

#Перевод в часы
def hour(x):
    return int(x/3600)

#Перевод в минуты str!!!
def minut(x):
    a = int(int(x)/60) - int(int(x)/3600)
    if a <10 : b = ("0" + str(a))
    else: b = str(a)
    return b

#Перевод в секунды str!!!
def secund(x):
    a = int(int(x) - (int(int(x)/60)*60))
    if a <10 : b = ("0" + str(a))
    else: b = str(a)
    return b

#Перевод 2^15 бит в 6,144В
def bit_u(x):
    return round((x*6.144)/32768, 5)

#Перевод 2^12 бит в 5В
def bit_u_DAC(x):
    return round((x*5)/4096, 5)

#Перевод 5В в 2^8 бит
def u_bit(x):
    return round((x*255)/5)

#Перевод мощности
def power200to100(x):
    return round((8/19)*x + 20 - (80/19))

#Перевод мощности
def power100to200(x):
    return round((19/8)*x + 10 - (95/2))


